MomoRC-tech/Viessmann-Waermepumpe-in-ESPhome-with-Optolink-DIY/Vitocal_Optolink-esp32C3/HA_mqtt_addin.h
    WWtempSollSens.setObjectId(HA_PREFIX "Warmwasser_Soll");
    WWtempSoll2Sens.setObjectId(HA_PREFIX "Warmwasser_Soll2");
    RaumSollTempSens.setObjectId(HA_PREFIX "Raumtemperatur");
    RaumSollRedSens.setObjectId(HA_PREFIX "Raumtemperatur_Red_soll");
    HystWWsollSens.setObjectId(HA_PREFIX "Hysterese_WW_soll");
    HKneigungSens.setObjectId(HA_PREFIX "NeigungHeizkennlinie");
    HKniveauSens.setObjectId(HA_PREFIX "NiveauHeizkennlinie");
    operationmodeSens.setObjectId(HA_PREFIX "modus");
    manualmodeSens.setObjectId(HA_PREFIX "man_modus");
    selectManualMode.setObjectId(HA_PREFIX "setManualMode");

    fastPollInterval.setObjectId(HA_PREFIX "fastPollInterval");
    mediumPollInterval.setObjectId(HA_PREFIX "mediumPollInterval");
    slowPollInterval.setObjectId(HA_PREFIX "slowPollInterval");

    vitoErrorCountSens.setObjectId(HA_PREFIX "vito_error_count");
    vitoConsecErrorSens.setObjectId(HA_PREFIX "vito_consecutive_errors");
    errorThresholdNumber.setObjectId(HA_PREFIX "vito_error_threshold");

    //*** setup sensors ***********************************************
    AussenTempSens.setIcon("mdi:home-thermometer-outline");     AussenTempSens.setName("Aussentemperatur");    AussenTempSens.setUnitOfMeasurement("C");
    WWtempObenSens.setIcon("mdi:bathtub");                      WWtempObenSens.setName("Warmwasser Oben");     WWtempObenSens.setUnitOfMeasurement("C");
    VorlaufTempSetSens.setIcon("mdi:thermometer-chevron-up");   VorlaufTempSetSens.setName("Vorlauf Soll");    VorlaufTempSetSens.setUnitOfMeasurement("C");  
    VorlaufTempSens.setIcon("mdi:thermometer-chevron-up");      VorlaufTempSens.setName("Vorlauf");            VorlaufTempSens.setUnitOfMeasurement("C");
    RuecklaufTempSens.setIcon("mdi:thermometer-chevron-down");  RuecklaufTempSens.setName("Ruecklauf");        RuecklaufTempSens.setUnitOfMeasurement("C");      

    heizkreispumpeSens.setIcon("mdi:pump");                  heizkreispumpeSens.setName("Heizkreispumpe");     
    WWzirkulationspumpeSens.setIcon("mdi:pump");             WWzirkulationspumpeSens.setName("WW Zirkulation");     
    ventilHeizenWWSens.setIcon("mdi:pipe-valve");             ventilHeizenWWSens.setName("Ventil Heizen-WW");   
    
    ventilHeizenWWSens.setForceUpdate(false);

    RelEHeizStufeSens.setIcon("mdi:radiator");                  RelEHeizStufeSens.setName("EHeizstufe");     
    RelVerdichterSens.setIcon("mdi:filter");                 RelVerdichterSens.setName("Verdichter");         
    RelPrimaerquelleSens.setIcon("mdi:pump");                RelPrimaerquelleSens.setName("Grundwasserpumpe");    
    RelSekundaerPumpeSens.setIcon("mdi:pump");              RelSekundaerPumpeSens.setName("Sekundaerpumpe"); 

    Stoerung.setIcon("mdi:alert-outline");                   Stoerung.setName("Stoerung");

    operationmodeSens.setIcon("mdi:state-machine");          operationmodeSens.setName("Modus"); 
    manualmodeSens.setIcon("mdi:braille");                   manualmodeSens.setName("Man.Modus"); 
    selectManualMode.setIcon("mdi:braille");                 selectManualMode.setName("set Man.Modus");
    selectManualMode.setOptions("normal;manuel;WW auf Temp2"); // use semicolons as separator of options
    selectManualMode.onCommand(onManualModeCommand); 

    WWtempSollSens.setIcon("mdi:state-machine");             WWtempSollSens.setName("Warmwasser Soll");             WWtempSollSens.setUnitOfMeasurement("C");         
    WWtempSollSens.setMin(20);  WWtempSollSens.setMax(60);   WWtempSollSens.setStep(1);                             WWtempSollSens.onCommand(setWWSoll);            WWtempSollSens.setMode(HANumber::ModeBox);  
    WWtempSoll2Sens.setIcon("mdi:state-machine");             WWtempSoll2Sens.setName("Warmwasser Soll2");             WWtempSoll2Sens.setUnitOfMeasurement("C");         
    WWtempSoll2Sens.setMin(20);  WWtempSoll2Sens.setMax(60);   WWtempSoll2Sens.setStep(1);                             WWtempSoll2Sens.onCommand(setWWSoll2);       WWtempSoll2Sens.setMode(HANumber::ModeBox);

    HKneigungSens.setIcon("mdi:chart-bell-curve-cumulative");             HKneigungSens.setName("Neigung Heizkennlinie");       HKneigungSens.setUnitOfMeasurement("-");         
    HKneigungSens.setMin(0);  HKneigungSens.setMax(1);      HKneigungSens.setStep(0.1);                           HKneigungSens.onCommand(setHKneigung);
    HKneigungSens.setMode(HANumber::ModeBox);
    
    HKniveauSens.setIcon("mdi:chart-bell-curve-cumulative");              HKniveauSens.setName("Niveau Heizkennlinie");         HKniveauSens.setUnitOfMeasurement("K");         
    HKniveauSens.setMin(0);   HKniveauSens.setMax(10);     HKniveauSens.setStep(0.1);                             HKniveauSens.onCommand(setHKniveau);
    HKniveauSens.setMode(HANumber::ModeBox);

    HystWWsollSens.setIcon("mdi:state-machine");               HystWWsollSens.setName("Hysterese WW Soll");       HystWWsollSens.setUnitOfMeasurement("C"); 
    HystWWsollSens.setMin(1);  HystWWsollSens.setMax(20);      HystWWsollSens.setStep(0.5);                       HystWWsollSens.onCommand(setHystWWsoll); 
    HystWWsollSens.setMode(HANumber::ModeBox);

    RaumSollTempSens.setIcon("mdi:state-machine");               RaumSollTempSens.setName("Raumtemperatur Soll");     RaumSollTempSens.setUnitOfMeasurement("C"); 
    RaumSollTempSens.setMin(10);  RaumSollTempSens.setMax(30);   RaumSollTempSens.setStep(0.5);                       RaumSollTempSens.onCommand(setRaumSoll);    
    RaumSollTempSens.setMode(HANumber::ModeBox);
    
    RaumSollRedSens.setIcon("mdi:state-machine");                RaumSollRedSens.setName("Raumtemperatur Red. Soll");     RaumSollRedSens.setUnitOfMeasurement("C");  
    RaumSollRedSens.setMin(10);   RaumSollRedSens.setMax(30);    RaumSollRedSens.setStep(0.5);                            RaumSollRedSens.onCommand(setRaumSollRed);  
    RaumSollRedSens.setMode(HANumber::ModeBox);

    // polling interval controls (seconds) - allow tuning from Home Assistant
    fastPollInterval.setIcon("mdi:timer-sand");
    fastPollInterval.setName("Vito Fast Poll Interval");
    fastPollInterval.setUnitOfMeasurement("s");
    fastPollInterval.setMin(5);
    fastPollInterval.setMax(300);
    fastPollInterval.setStep(1);
    fastPollInterval.setMode(HANumber::ModeBox);  
    fastPollInterval.setRetain(true);  // keep value across broker restarts
    fastPollInterval.onCommand([](HANumeric number, HANumber* sender) {
        if (!number.isSet() || sender == nullptr) {
            return;
        }
        float requested = number.toFloat();
        float applied = requested < 5.0f ? 5.0f : requested;
        vitoFastState.intervalMs = (uint32_t)(applied * 1000.0f);
        sender->setState(applied);
    });

    mediumPollInterval.setIcon("mdi:timer-sand-half");
    mediumPollInterval.setName("Vito Medium Poll Interval");
    mediumPollInterval.setUnitOfMeasurement("s");
    mediumPollInterval.setMin(5);
    mediumPollInterval.setMax(600);
    mediumPollInterval.setStep(1);
    mediumPollInterval.setMode(HANumber::ModeBox); 
    mediumPollInterval.setRetain(true);
    mediumPollInterval.onCommand([](HANumeric number, HANumber* sender) {
        if (!number.isSet() || sender == nullptr) {
            return;
        }
        float requested = number.toFloat();
        float applied = requested < 5.0f ? 5.0f : requested;
        vitoMediumState.intervalMs = (uint32_t)(applied * 1000.0f);
        sender->setState(applied);
    });

    slowPollInterval.setIcon("mdi:timer-sand-complete");
    slowPollInterval.setName("Vito Slow Poll Interval");
    slowPollInterval.setUnitOfMeasurement("s");
    slowPollInterval.setMin(5);
    slowPollInterval.setMax(1800);
    slowPollInterval.setStep(1);
    slowPollInterval.setMode(HANumber::ModeBox); 
    slowPollInterval.setRetain(true);
    slowPollInterval.onCommand([](HANumeric number, HANumber* sender) {
        if (!number.isSet() || sender == nullptr) {
            return;
        }
        float requested = number.toFloat();
        float applied = requested < 5.0f ? 5.0f : requested;
        vitoSlowState.intervalMs = (uint32_t)(applied * 1000.0f);
        sender->setState(applied);
    });

    HVACwaermepumpe.setName("Waermepumpe");                                       
    HVACwaermepumpe.setMinTemp(10);
    HVACwaermepumpe.setMaxTemp(30);
    HVACwaermepumpe.setTempStep(0.5);
    HVACwaermepumpe.setModes(HAHVAC::OffMode | HAHVAC::HeatMode  | HAHVAC::CoolMode);
    HVACwaermepumpe.onTargetTemperatureCommand(onTargetTemperatureCommand);
    HVACwaermepumpe.onPowerCommand(onPowerCommand);
    HVACwaermepumpe.onModeCommand(onModeCommand);    
    
    //*** setup MQTT ***********************************************
    //mqtt.onMessage(onMQTTMessage);
    mqtt.onConnected(onMQTTConnected);
    mqtt.onDisconnected(onMQTTDisconnected);
    mqtt.setDataPrefix(MQTT_DATAPREFIX);
    mqtt.setDiscoveryPrefix(MQTT_DISCOVERYPREFIX);
    bool mqttBeginOk = mqtt.begin(BROKER_ADDR, BROKER_PORT, BROKER_USERNAME, BROKER_PASSWORD);
    CONSOLE_SERIAL.printf("[MQTT] begin(%s:%u) -> %s\n", BROKER_ADDR, (unsigned)BROKER_PORT, mqttBeginOk ? "ok" : "failed");

